create table Manager
(
	UserId int primary key not null AUTO_INCREMENT,
	UserName varchar(30) not null,
	PassWord varchar(30) not null,
	Enable int not null,
	IsDelete int not null,
	RegTime varchar(20),
	RegIp varchar(20),
	LastLoginTime varchar(20),
	LastLoginIp varchar(20),
	ParentId int 
);
INSERT INTO `Manager` VALUES (1,'admin','123456',1,0,null,null,null,null,0);
create table CPType
(
	Id int primary key not null auto_increment,
	Type int not null,
	Enable int not null,
	IsDelete int not null,
	Sort int,
	Name varchar(30),
	CodeList varchar(125) not null default '0,1,2,3,4,5,6,7,8,9',
	Title varchar(20),
	ShortName varchar(10),
	Info varchar(100),
	OnGetNode varchar(50),
	BetStopTime int,
	DefaultShowGroup int ,
	Android int ,
	Num int 
);
select * from CPtype
INSERT INTO CPType VALUES 
(1,1,1,0,1,'ssccq',default,'重庆时时彩','重庆彩','白天：10:00～22:00 十分钟/期夜场：22:00～01:55 五分钟/期全天：120期','noHdCQSSC',20,2,0,120)
,(2,1,0,0,2,'sscjx',default,'江西时时彩','江西彩','时间：09:00～23:00频率：10分钟/期全天：84期','no0Hd',20,2,0,84)
,(6,1,1,0,2,'ssctj',default,'天津时时彩','天津彩','时间：09:10～23:00频率：10分钟/期全天：84期','no0Hd',20,2,0,84)
,(7,3,1,0,10,'fc3d',default,'福彩3D','福彩3D','每天 20:30开奖','pai3',300,16,0,1)
,(8,3,0,0,11,'pl3',default,'排列三','排列三','每天 20:30开奖','pai3',300,16,0,1)
,(9,1,1,0,3,'sscxj',default,'新疆时时彩','新疆彩','时间：10:00～次日02:00频率：10分钟/期全天：96期','noxHd',20,2,0,96)
,(3,5,1,0,30,'ffc', default,'分分彩','分分彩','时间：00:00～23:59 一分钟/期全天：1440期','no0Hdf',30,59,0,1440)
,(15,5,1,0,29,'lfc',default,'两分彩','两分彩','时间：00:00～23:58 两分钟/期全天：720期','no0Hd',6,59,0,720)
,(10,5,1,0,28,'wfc',default,'五分彩','五分彩','时间：00:00～23:55 五分钟/期全天：288期','no0Hd',8,59,0,288)
,(11,2,1,0,9,'jx11x5','01,02,03,04,05,06,07,08,09,10,11','江西多乐彩','江西多乐彩','时间：09:10～22:00频率：10分钟/期全天：78期','no0Hd',20,77,0,84)
,(4,2,1,0,4,'gd11x5','01,02,03,04,05,06,07,08,09,10,11','广东11选5','广东11选5','时间：09:00～23:00频率：10分钟/期全天：84期','no0Hd',20,77,0,84)
,(5,2,1,0,8,'sd11x5','01,02,03,04,05,06,07,08,09,10,11','重庆11选5','重庆11选5','时间：08:36～22:56频率：10分钟/期全天：78期','no0Hdsd',20,77,0,87)
,(12,4,1,0,18,'cqxylc','01,02,03,04,05,06,07,08,09,10,11,12,13,14,15,16,17,18,19,20','幸运农场','幸运农场','时间：10:03～02:03频率：10分钟/期全天：97期','no0Hd',20,19,0,97)
,(13,6,1,0,17,'bjpk10','01,02,03,04,05,06,07,08,09,10','北京PK拾','北京PK拾','时间：09:00～23:57频率：5分钟/期全天：179期','BJpk10',20,26,0,179)
,(14,9,0,0,19,'jsk3','1,2,3,4,5,6','江苏快3','江苏快3','时间：08:40～22:10频率：10分钟/期全天：82期','no0Hdk3',20,39,0,82)
,(16,10,0,1,50,'lhc','01,02,03,04,05,06,07,08,09,10,11','香港六合彩','六合彩','每周三次，周二、周四及非赛马日之周六或周日晚上开奖开奖时间：21:40','no6Hd',600,81,0,149)
,(17,1,1,0,1,'sscqq',default,'腾讯分分彩','腾讯分分彩','时间：00:00～23:59 一分钟/期全天：1440期','no0Hdf',5,2,0,1440)
,(18,1,1,0,1,'sschg',default,'韩国1.5分彩','韩国1.5分彩','时间：00:00～23:00 90秒/期全天：920期','hg15',5,59,0,920)
,(19,1,1,0,1,'ssctw',default,'台湾五分彩','台湾五分彩','白天：10:00～22:00 十分钟/期夜场：22:00～01:55 五分钟/期全天：120期','tw5fc',5,2,0,203);
